all_dict = {}

n = int(input())  # რიცხვი,რამდენი სიტყვაც შედის

for _ in range(n):

    word = str(input())  # ვიღებთ სიტყვებს

    # ვამოწმებთ არის თუ არა დუბლიკატი შიგნით,თუ არის,არსებულ ერთს რომელიც ზის value-ში ვუმატებთ კიდევ 1ს
    if word in all_dict:
        all_dict[word] += 1
    else:
        all_dict[word] = 1  # თუ არ არის მაშინ ვუტოლებთ ერთს(ანუ დუბლიკატი არ არის და რჩება მარტო),value-არ იცვლება

print(len(all_dict))  # გამოგვაქვს ერთმანეთისგან გამორჩეული სიტყვების რაოდენობა სიგრძის გამოსათვლელი ფუნქციით

for i in all_dict:
    print(all_dict[i], end=" ")  # ფუნქციით ვწვდებით key-ს და გამოგვაქვს Value-ს რაოდენობა


